#include "config.h"

/*****************************************************************
* @sysWork：项目的主要功能初始化函数
* @arg:
*		无
* @return:
*		无
*****************************************************************/
void sysInit(void)
{
	
}

/*****************************************************************
* @sysWork：项目的主要功能逻辑函数
* @arg:
*		无
* @return:
*		无
*****************************************************************/
void sysWork(void)
{
	int temp = (int)(ds18b20Read()*10);
	segBuff[0] = temp/100;//scanBtn();
	segBuff[1] = temp/10%10+12;
	segBuff[2] = temp%10;
	segDisplay();
}

