#ifndef _CONFIG_H
#define _CONFIG_H

#include "main.h"
#include "key.h"
#include "led.h"
#include "lcd.h"

/***********************************************
* 函数功能：自定义的系统初始化
* 函数参数：无
* 函数返回值：无
***********************************************/
void sysInit(void);

/***********************************************
* 函数功能：系统工作逻辑函数
* 函数参数：无
* 函数返回值：无
***********************************************/
void sysWork(void);

/***********************************************
* 函数功能：显示输出界面
* 函数参数：无
* 函数返回值：无
***********************************************/
void STAViewDisplay(void);

/***********************************************
* 函数功能：显示密码输入界面
* 函数参数：无
* 函数返回值：无
***********************************************/
void PSDViewDisplay(void);

/****************************************
* 函数功能：修改PWM的频率工作
* 函数参数：
*			unsigned int autoreloadDate:重装载值
*			unsigned int compareDate:PWM的比较值
* 函数返回值：无
****************************************/
void pwmWorkByFre(unsigned int autoreloadDate,unsigned int compareDate);

/********************************************
* 函数功能：
* 函数参数:无
* 函数返回值:无
********************************************/
void keyProc(void);

/********************************************
* 函数功能：
* 函数参数:无
* 函数返回值:无
********************************************/
void getPasswdByUsart(void);
/***********************************************
* 函数功能：LED的相关显示
* 函数参数：无
* 函数返回值：无
***********************************************/
void ledDisplay(void);



#endif
